//**************************************************************************************************
//
// ビルボード描画処理(billboard.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _BILLBOARD_H_			// このマクロ定義がされてなかったら
#define _BILLBOARD_H_			// 二重インクルード防止のマクロ定義

//***************************************************************************
// インクルード
//***************************************************************************
#include "main.h"

//***************************************************************
// ビルボード構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;			// 位置
	D3DXVECTOR3		posOld;			// 過去位置
	D3DXVECTOR3		move;			// 移動量
	D3DXVECTOR3		rot;			// 向き
	D3DXMATRIX		mtxWorld;		// ワールドマトリックス
	float			fRadius;		// 半径
	int				nIdx;			// インデックス
	bool			bUse;			// 使用状況
}Billboard;

//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	InitBillboard		(void);
void	UninitBillboard		(void);
void	UpdateBillboard		(void);
void	DrawBillboard		(void);

// 副制御関数
void	SetBillboard		(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fSpeed);
Billboard *GetBillboard		(void);

#endif
