//**************************************************************************************************
//
// フェード処理
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _FADE_H_		// このマクロ定義がされてなかったら
#define _FADE_H_		// 二重インク―ルード防止のマクロ定義

#include"main.h"

//************************************************************
// プレイヤーの状態の列挙型
//************************************************************
typedef enum
{
	FADE_NONE = 0,	// 何もしてない状態
	FADE_IN,		// フェードイン状態
	FADE_OUT,		// フェードアウト状態
	FADE_MAX
}FADE;

//************************************************************
// プロトタイプ宣言
//************************************************************
void	InitFade	(MODE modeNext);
void	UninitFade	(void);
void	UpdateFade	(void);
void	DrawFade	(void);
void	SetFade		(MODE modeNext);
FADE	GetFade		(void);

#endif