//**************************************************************************************************
//
// ファイルのマクロ
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _FILE_H_
#define _FILE_H_

//***************************************************************************
// インクルード
//***************************************************************************
#include"main.h"

//**********************************************************
// マクロ定義
//**********************************************************
#define			MAX_FILE_NAME				(128)						// ファイル名の長さの最大値
#define			FILE_TEXTURE_DATA			"data/TEXTURE/"				// テクスチャデータの相対パス
#define			FILE_MODEL_DATA				"data/MODEL/"				// モデルデータの相対パス
#define			FILE_MOTION_DATA			"data/MOTION/"				// モデルデータの相対パス
#define			FILE_PARTICLE_DATA			"data/FILE/PARTICLE/"		// パーティクルファイルデータの相対パス	
#define			FILE_RANKING_DATA			"data/FILE/RANKING/"		// ランキングファイルデータの相対パス
#define			FILE_3D_STAGE				"data/FILE/STAGE/"			// ステージファイルデータの相対パス

#endif
