//**************************************************************************************************
//
// メッシュフィールド描画処理(meshfield.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _MESHFIELD_H_			// このマクロ定義がされてなかったら
#define _MESHFIELD_H_			// 二重インクルード防止のマクロ定義

//***************************************************************************
// インクルード
//***************************************************************************
#include"main.h"

//***************************************************************
// メッシュフィールド構造体を定義
//***************************************************************
typedef struct
{
	int nNumBlockX;
	int nNumBlockZ;
	int nNumBlockXAddOne;
	int nNumBlockZAddOne;
}Mesh;

//***************************************************************
// メッシュフィールド構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;			// 位置
	D3DXVECTOR3		rot;			// 向き
	D3DXMATRIX		mtxWorld;		// ワールドマトリックス
}MeshField;

//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	InitMeshField(void);
void	UninitMeshField(void);
void	UpdateMeshField(void);
void	DrawMeshField(void);

#endif
