//**************************************************************************************************
//
//ポーズ背景の設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _PAUSE_BG_H_		//このマクロ定義がされてなかったら
#define _PAUSE_BG_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//*************************************************************
//マクロ定義
//*************************************************************
#define MAX_OFFSET_PBG_X	(300.0f)	//大きさ(幅)
#define MAX_OFFSET_PBG_Y	(300.0f)	//大きさ(高さ)

//************************************************************
//ポーズ背景の構造体を定義
//************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							//中心点
	D3DXVECTOR3 offset;							//中心点からの差
	D3DXVECTOR3 rot;							//向き
	D3DXCOLOR col;								//カラー
	float fLength;								//対角線の長さ
	float fAngele;								//対角線の角度
	bool bUse;									//使用してるかどうか
}PauseBG;

//****************************************
//プロトタイプ宣言
//****************************************
void InitPauseBG(void);
void UninitPauseBG(void);
void UpdatePauseBG(void);
void DrawPauseBG(void);
void SetPauseBG(void);

#endif
