//**************************************************************************************************
//
//ポーズ画面の設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _PAUSE_H_		//このマクロ定義がされてなかったら
#define _PAUSE_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//************************************************************
//ポーズ画面後の処理の列挙型
//************************************************************
typedef enum
{
	NEXTPROCESS_CONTINUE = 0,	//ゲーム画面(継続)
	NEXTPROCESS_RETRY,			//ゲーム画面(最初から)
	NEXTPROCESS_QUIT,			//タイトル画面
	NEXTPROCESS_MAX				//ポーズ画面後の処理の最大数
}NEXTPROCESS;

//*************************************************************
//ポーズ画面構造体の定義
//*************************************************************
typedef struct
{
	NEXTPROCESS state;				//次の処理
	int nCountKey;					//キーが押された数
	bool bDisp;						//表示してるかどうか
}Pause;

//****************************************
//プロトタイプ宣言
//****************************************
void InitPause(void);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);
void SetPause(void);
Pause *GetPause(void);

#endif
