//**************************************************************************************************
//
// ポリゴン描画処理(polygon.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _POLYGON_H_			// このマクロ定義がされてなかったら
#define _POLYGON_H_			// 二重インクルード防止のマクロ定義

//***************************************************************
// ポリゴン構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;			// 位置
	D3DXVECTOR3		rot;			// 向き
	D3DXMATRIX		mtxWorld;		// ワールドマトリックス
}POLYGON;
						
//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	InitPolygon		(void);
void	UninitPolygon	(void);
void	UpdatePolygon	(void);
void	DrawPolygon		(void);

#endif