//**************************************************************************************************
//
//クワイエットの設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _QUIT_H_		//このマクロ定義がされてなかったら
#define _QUIT_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//*************************************************************
//マクロ定義
//*************************************************************
#define POS_QUIT_X			(640.0f)	//位置(X)
#define POS_QUIT_Y			(480.0f)	//位置(Y)
#define MAX_OFFSET_QUIT_X	(250.0f)	//大きさ(幅)
#define MAX_OFFSET_QUIT_Y	(50.0f)		//大きさ(高さ)

//************************************************************
//クワイエットの構造体を定義
//************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							//中心点
	D3DXVECTOR3 offset;							//中心点からの差
	D3DXVECTOR3 rot;							//向き
	D3DXCOLOR col;								//カラー
	float fLength;								//対角線の長さ
	float fAngele;								//対角線の角度
	bool bUse;									//使用してるかどうか
}Quit;

//****************************************
//プロトタイプ宣言
//****************************************
void InitQuit(void);
void UninitQuit(void);
void UpdateQuit(void);
void DrawQuit(void);
void SetQuit(void);

#endif