//**************************************************************************************************
//
//ランキングロゴの設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _RANKING_LOGO_H_		//このマクロ定義がされてなかったら
#define _RANKING_LOGO_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//*************************************************************
//マクロ定義
//*************************************************************
#define MAX_OFFSET_RL_X	(640.0f)	//大きさ(幅)
#define MAX_OFFSET_RL_Y	(100.0f)	//大きさ(高さ)

//************************************************************
//タイトルロゴの構造体を定義
//************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							//中心点
	D3DXVECTOR3 offset;							//中心点からの差
	D3DXVECTOR3 rot;							//向き
	float fLength;								//対角線の長さ
	float fAngele;								//対角線の角度
	bool bUse;									//使用してるかどうか
}RankingLogo;

//****************************************
//プロトタイプ宣言
//****************************************
void InitRankingLogo(void);
void UninitRankingLogo(void);
void UpdateRankingLogo(void);
void DrawRankingLogo(void);
void SetRankingLogo(void);

#endif
