//**************************************************************************************************
//
//リザルト画面の設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _RESULT_H_		//このマクロ定義がされてなかったら
#define _RESULT_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//****************************************
//プロトタイプ宣言
//****************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
