//**************************************************************************************************
//
//リザルトメニューの設定処理
//Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _RESULT_MENU_H_		//このマクロ定義がされてなかったら
#define _RESULT_MENU_H_		//二重インク―ルード防止のマクロ定義

#include"main.h"

//*************************************************************
//マクロ定義
//*************************************************************
#define MAX_OFFSET_RM_X	(300.0f)	//大きさ(幅)
#define MAX_OFFSET_RM_Y	(120.0f)	//大きさ(高さ)

//************************************************************
//リザルトメニューの構造体を定義
//************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							//中心点
	D3DXVECTOR3 offset;							//中心点からの差
	D3DXVECTOR3 rot;							//向き
	D3DXCOLOR col;								//カラー
	float fLength;								//対角線の長さ
	float fAngele;								//対角線の角度
	bool bUse;									//使用してるかどうか
}ResultMenu;

//****************************************
//プロトタイプ宣言
//****************************************
void InitResultMenu(void);
void UninitResultMenu(void);
void UpdateResultMenu(void);
void DrawResultMenu(void);
void SetResultMenu(void);

#endif