//**************************************************************************************************
//
// モーション読み込み処理(set_motion.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _SET_MOTION_H_			// このマクロ定義がされてなかったら
#define _SET_MOTION_H_			// 二重インクルード防止のマクロ定義

//***************************************************************************
// インクルード
//***************************************************************************
#include"main.h"
#include"player.h"

//***************************************************************
// プレイヤーセット構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;									// 現在位置
	D3DXVECTOR3		rot;									// 現在の向き
	ModelParts		*modeParts;								// モデルパーツ
	int				nCntModelType;							// モデルのタイプ数
	int				nCntModelParts;							// 扱うモデルパーツ数
	int				nCntMotion;								// モーション数
	int				nCntKeySet;								// キーセット数
	int				nCntKey;								// キー数
	char			aPartsFile[MAX_MODEL_PARTS][128];		// ファイル名
}PlayerSet;

//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	LoodSetMotion		(char *pFileName);
void	OutputSetMotion		(void);

#endif
