//**************************************************************************************************
//
// スカイボックス描画処理(skybox.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _SKYBOX_H_			// このマクロ定義がされてなかったら
#define _SKYBOX_H_			// 二重インクルード防止のマクロ定義

//***************************************************************************
// インクルード
//***************************************************************************
#include"main.h"

//***************************************************************
// スカイボックス構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;			// 位置
	D3DXVECTOR3		rot;			// 向き
	D3DXMATRIX		mtxWorld;		// ワールドマトリックス
}SkyBox;

//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	InitSkyBox		(void);
void	UninitSkyBox	(void);
void	UpdateSkyBox	(void);
void	DrawSkyBox		(void);
void	InitSkyLid		(void);
void	DrawSkyLid		(void);


#endif


