//**************************************************************************************************
//
// タイトル画面の設定処理
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _TITLE_H_		// このマクロ定義がされてなかったら
#define _TITLE_H_		// 二重インク―ルード防止のマクロ定義

#include"main.h"

//*************************************************************
// マクロ定義
//*************************************************************
#define MAX_RANKING_TIME	(900)	// ランキング画面に遷移するまでの時間

//****************************************
// プロトタイプ宣言
//****************************************
void	InitTitle		(void);
void	UninitTitle		(void);
void	UpdateTitle		(void);
void	DrawTitle		(void);

#endif