//**************************************************************************************************
//
// チュートリアル処理
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _TUTORIAL_H_		// このマクロ定義がされてなかったら
#define _TUTORIAL_H_		// 二重インク―ルード防止のマクロ定義

#include"main.h"

//************************************************************
// プロトタイプ宣言
//************************************************************
void	InitTutorial	(void);
void	UninitTutorial	(void);
void	UpdateTutorial	(void);
void	DrawTutorial	(void);

#endif
