//**************************************************************************************************
//
// 壁描画処理(wall.h)
// Auther：唐﨑結斗
//
//**************************************************************************************************
#ifndef _WALL_H_			// このマクロ定義がされてなかったら
#define _WALL_H_			// 二重インクルード防止のマクロ定義

//***************************************************************************
// インクルード
//***************************************************************************
#include "main.h"

//***************************************************************
// 壁構造体を定義
//***************************************************************
typedef struct
{
	D3DXVECTOR3		pos;			// 位置
	D3DXVECTOR3		rot;			// 向き
	D3DXVECTOR3		aVecLine;		// 壁のベクトル
	D3DXMATRIX		mtxWorld;		// ワールドマトリックス
	D3DXCOLOR		col;			// カラー
	bool			bUse;			// 使用状況
}Wall;

//***************************************************************
// プロトタイプ宣言
//***************************************************************
// 制御関数
void	InitWall		(void);
void	UninitWall		(void);
void	UpdateWall		(void);
void	DrawWall		(void);

// 副制御関数
void	SetWall					(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXCOLOR col);
bool	CollisionWallBillBoard	(D3DXVECTOR3 *pos, D3DXVECTOR3 *posOld,int nIdx);

#endif

